/*
불변(immutable)의 뜻 - 문자열 일부만 수정을 할 수 없다.

var str string = "Hello World"
str = "How are you?"			// 전체 바꾸기는 가능
str[2] = 'a'					// Error!! 일부 바꾸기는 불가능



왜 문자열은 불변일까?
완결성이 보장이 안된다. consident <-- 불변을 지켜주지 않다면 공유가 안됨

서로 다른 메모리를 가리킨다면 가능 
근데 go는 대입할땐 공유 문자를 바꿀땐 복사 


모든 문제를 단번에 해결할 수 있는 은총알은 없다.


같은 메모리 공간을 가리키니까 불변

불변이 안되면 문자열을 대입을 할 때 그때그때 공간을 새롭게 할당해야 하기 떄문에 비효율 
불변하면 공유가 된다. --> 데이터의 일관성을 지킬 수 있기 때문

slice의 정초전

string은 2개의 필드다. data와 len
slice는 3개 data와 len, cap이다.

두 구조가 비슷하다. go에선 slice를 많이 쓴다.
*/

