/*
	1. 공간  --> 
	2. 주소값 --> 8바이트  성능이 좋아짐 메모리 사용량도 줄어듦



	구조체 포인터 초기화
	
	[기존 방식]
	var data Data
	var p *Data = &data				
	--------
	
	[구조체를 생성해 초기화하는 방식]
	var p *Data = &Data{} // Data 구조체를 만들어 주소를 반환함 <-- 구조체를 생성해 초기화하는 방식



	인스턴스

	인스턴스(instance)는 메모리에 할당된 데이터의 실체

	var data Data
	var p *Data = &data //


	var p *Data = &Data{}
	 
	 0x100 -----> 0x0100
	  [p]			Data
	  	Dat 인스턴스 하나가 만들어졌고
		포인터 변수 P가 가리킨다.


		객체 --> Life cycle
		객체가 인스턴스가 됐다는건 Life cycle이 생겼다 라는 뜻

	new() 내장 함수

	p1 := &Data[]		// &를 사용하는 초기화
	var p2 = new(Data)	// new()를 사용하는 초기화 --> 편하게 다들 사용함


	인스턴스는 언제 사라지나?
	인스턴스는 아무도 찾지 않을때 사라진다.

	func TestFunc() {
		u := &User{}		// u 포인터 변수를 선언하고 인스턴스를 생성
		u.Age = 30
		fmt.Println(u)		
	}	// 내부 변수 u는 사라짐. 더불어 인스턴스도 사라짐 


	다음번 gc 타임에 사라짐



	정리하면

	인스턴스는 메모리에 생성된 데이터의 실체
	포인터를 이용해서 인스턴스를 가리키게 할 수 있다.
	함수 호출 시 포인터 인수를 통해 인스턴스를 입력받고 그 값을 변경할 수 있게 된다.
	쓸모 없어진 인스턴스는 가비지컬렉터가 자동으로 지워준다.
*/